In [1]:
import requests
import pandas as pd
import bs4

from bs4 import BeautifulSoup
import re

In [2]:
#df = pd.read_csv('Public Script Sources - public_scripts.csv')

In [3]:
def scrape_webpage(url): #rename function to be more meaningful
    response = requests.get(url)
    html_string = response.text
    return html_string

In [4]:
url = 'https://humanist.kdl.kcl.ac.uk/Archives/Converted_Text/'

In [5]:
content = scrape_webpage(url)
soup = BeautifulSoup(content, "html.parser")
links = soup.find_all('a')

In [6]:
text_meta = soup.text.split()[6:-4]

In [7]:
name = text_meta[::4]
years = text_meta[1::4]
times = text_meta[2::4]
volumes = text_meta[3::4]

In [8]:
data = []
for i in range(len(name)):
    dict_ = {'text_name':name[i],
            'Year':years[i],
            'Time':times[i],
            'Volume':volumes[i]}
    data.append(dict_)

In [9]:
#data

In [10]:
humanist_vols = pd.DataFrame.from_dict(data)

In [11]:
humanist_vols

                 text_name         Year   Time   Volume
0   humanist.1987-1988.txt  26-Oct-2018  11:09  2354980
1   humanist.1988-1989.txt  26-Oct-2018  11:09  1535924
2   humanist.1989-1990.txt  26-Oct-2018  11:09  4663437
3   humanist.1990-1991.txt  26-Oct-2018  11:09  4973851
4   humanist.1991-1992.txt  26-Oct-2018  11:09  3243062
5   humanist.1992-1993.txt  26-Oct-2018  11:09  2934777
6   humanist.1993-1994.txt  26-Oct-2018  11:09  2776195
7   humanist.1994-1995.txt  26-Oct-2018  11:09  1739016
8   humanist.1995-1996.txt  26-Oct-2018  11:09  2494851
9   humanist.1996-1997.txt  26-Oct-2018  11:09  2109480
10  humanist.1997-1998.txt  26-Oct-2018  11:09  3678774
11  humanist.1998-1999.txt  26-Oct-2018  11:09  2907550
12  humanist.1999-2000.txt  26-Oct-2018  11:09  2652849
13  humanist.2000-2001.txt  26-Oct-2018  11:09  3232307
14  humanist.2001-2002.txt  26-Oct-2018  11:09  2634930
15  humanist.2002-2003.txt  26-Oct-2018  11:09  2419876
16  humanist.2003-2004.txt  26-Oct-2018  11:09  2834023
17  humanist.2004-2005.txt  26-Oct-2018  11:09  2718227
18  humanist.2005-2006.txt  26-Oct-2018  11:09  2665694
19  humanist.2006-2007.txt  26-Oct-2018  11:09  2238595
20  humanist.2007-2008.txt  26-Oct-2018  11:09  1868483

In [12]:
humanist_vols.to_csv('web_scraped_humanist_listserv.csv')

In [13]:
df1 = pd.read_csv('character_list5.csv',encoding='latin-1')
df2 = pd.read_csv('character_mapping.csv',encoding='latin-1')
df3 = pd.read_csv('meta_data7.csv',encoding='latin-1')

In [110]:
df1.dropna(inplace=True)
df1.head(5)

   script_id imdb_character_name  words gender   age
0        280               betty    311      f  35.0
3        280     francesca johns   2251      f  46.0
4        280               madge    190      f  46.0
5        280     michael johnson    723      m  38.0
6        280      robert kincaid   1908      m  65.0

In [111]:
df2.dropna(inplace=True)
df2.head(5)

,script_id,imdb_id,character_from_script,closest_character_name_from_imdb_match,closest_imdb_character_id
0,1,tt0147800,bianca,bianca stratford,nm0646351
1,1,tt0147800,cameron,cameron james,nm0330687
2,1,tt0147800,chastity,chastity,nm0005517
3,1,tt0147800,joey,joey donner,nm0005080
4,1,tt0147800,kat,kat stratford,nm0005466

In [112]:
df3.dropna(inplace=True)
df3.sort

,script_id,imdb_id,title,year,gross,lines_data
0,1534,tt1022603,(500) Days of Summer,2009,37.0,7435445256774774443342577775657744434444564456...
1,1512,tt0147800,10 Things I Hate About You,1999,65.0,1777752320274533344457777722433777334443764677...
3,1517,tt2024544,12 Years a Slave,2013,60.0,4567334777777777777777447777756477777444777777...
4,1520,tt1542344,127 Hours,2010,20.0,453513352345765766777777773340
5,6537,tt0450385,1408,2007,91.0,37677777777777777776777737566646444336777661